alefragnani.rtf
anthropic.claude-code
astro-build.astro-vscode
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
cschlosser.doxdocgen
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
gruntfuggly.todo-tree
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
pkief.material-icon-theme
redhat.vscode-yaml
reditorsupport.r
reditorsupport.r-syntax
tamasfe.even-better-toml
tomoki1207.pdf
usernamehw.errorlens
vadimcn.vscode-lldb
xaver.clang-format
